app/Controllers/DashboardController.php

SELECT *
FROM `usuario`
---
    public function admin()
    {
<<<<<<< HEAD
        if (session()->get('ID_Rol') != 4) {
            return redirect()->to(base_url('login'));
        }
        $model = new UsuarioModel();
        $data['usuarios'] = $model->findAll();

SELECT *
FROM `comunidad`
---
    public function admin_comunidad(){
        $model = new ComunidadModel();
        $data['comunidades'] = $model->findAll(); // Obtén todas las comunidades